trade_exp/src/Enums/ПорядокРасчетов/ПорядокРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПорядокРасчетов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПоДоговорамКонтрагентов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоЗаказамНакладным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоНакладным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="27ca6d68-e67a-4889-9637-02a127ea6bb7">
    <name>ПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4f954f84-d9f9-4d34-8b96-cd90db36a2c4">
    <name>ПоДоговорамНакладным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ТипыРасчетовСПартнерами/ТипыРасчетовСПартнерами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0d6d53c9-63ee-44f8-8520-8cb643b1df21">
  <name>ТипыРасчетовСПартнерами</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="2efefc30-c158-4305-8f41-1131dfd4b818">
    <name>РасчетыСКлиентом</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="115f7bfa-174a-4de6-8149-8a0aa21cb6ea">
    <name>РасчетыСПоставщиком</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/ОбъектыРасчетов/ОбъектыРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0c588f17-899d-4631-99f3-44aaf039357e">
  <name>ОбъектыРасчетов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="bba798d9-42bd-4341-8275-e5503a1fd11c">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d9b52c65-7828-4280-a247-e281ed971ffb">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Организации</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="4a3b4661-75a6-4317-9e52-a21fb3ad20b9">
    <name>ГоловнаяОрганизация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="64303e94-490e-4229-a86f-9d6a6769b763">
    <name>СвидетельствоСерияНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a184b1dd-510a-46f6-b38c-2a1c8ff0217a">
    <name>ИндивидуальныйПредприниматель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0038fc7e-3157-476b-824d-811a30639c88">
    <name>ЦифровойИндексОбособленногоПодразделения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="11eb9dbe-02b3-4892-b634-f243b2dfd2f1">
    <name>НаименованиеСокращенное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0b153de3-87fe-4907-9e94-8556af48fda2">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>350</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="685363b5-d549-4059-81c3-83f4001dac92">
    <name>НаименованиеМеждународное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9a4098b9-639a-42f1-8113-779c62420e46">
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c85b7b22-c967-4a95-a863-4e454f1b47e2">
    <name>КПП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1a2fdd27-2959-4e3e-9039-80e8cebcf1e2">
    <name>ОГРН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="38df9827-83de-429d-a872-d44c4a5b383a">
    <name>КодОКВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f17d55e6-7114-4f91-bee2-e2e64e65fa8b">
    <name>СвидетельствоДатаВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9e332fa6-d24a-436f-bac7-5e086c273763">
    <name>КодОКВЭД2</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="33c042cb-b26c-4c0d-acac-fde61b334c1f">
    <name>КодПоОКПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d9e54389-8d99-4508-af2e-411a4520ca52">
    <name>КрупнейшийНалогоплательщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1affc249-13d0-477e-b7a9-8a2b51caeb55">
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="75dc325f-619e-4beb-99ba-e69da503125b">
    <name>Префикс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0625e5ef-5727-4476-afca-88c6fce30fcd">
    <name>КодНалоговогоОрганаПолучателя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ecc0dbb2-ffb6-44df-9a60-571932153ea5">
    <name>ДопускаютсяВзаиморасчетыЧерезГоловнуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="83555d53-4331-4f0c-9a15-c46c7d8c9e73">
    <name>НеЗаполнятьПодразделенияВМероприятияхТрудовойДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4d80bc0f-7d7f-4ff4-93ab-543d1d25a291">
    <name>ОсновнойБанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a4024143-e1cb-476d-894b-fddfad0ec381">
    <name>ПочтаДляОтправкиЧеков</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="fc96f1dd-6f54-47fc-9ea0-8bfb74389f11">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="4e2d3166-2276-47be-8837-c74b7e81327b">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="024cbd28-680f-40ae-9c2b-0e5600ebfd55">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="92d97506-6b5d-4a98-8493-91142ebd6edf">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4686a37e-5813-4248-a25d-441c704148a8">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="bf43cd52-c4c6-4a0e-be4c-d6473a70f888">
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="62e2f31f-4830-4732-9c1e-c35667ad180c">
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="60d3c443-159d-4750-9a66-51f51aa48da3">
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="05c9b81d-52a4-42f0-a660-49fa30ec68ed">
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="84d3b7a3-8e2c-4170-9708-e5c71db31083">
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1906b501-6bec-4ab6-af75-4550787d384a">
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a2c4492e-03b6-4191-b37f-688f05e99339">
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ddf91d57-4d4a-4d27-af8a-f4a566ce0a0f">
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e8d57e5d-14a4-485f-bf20-057f85fe2a64">
      <name>ДействуетС</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="0f565466-19e0-4edb-9827-dab5a2bb47d7">
      <name>ВидДляСписка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="a04707a3-5da7-4de7-b5b1-d765060e5068">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="1bb42db9-4fd2-4fc4-a0bc-7c326b817c96">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f8e2f403-2cb5-4858-9fd2-309e9b6e158d">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a96e4c36-3ced-4239-a359-371b1f6df027">
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/CommonModules/ОбъектыРасчетовСервер/Module.bsl
&ИзменениеИКонтроль("ПроверитьОбъектыРасчетовПередЗаписью")
Процедура Док_ПроверитьОбъектыРасчетовПередЗаписью(Объект, МассивСтруктур, РежимЗаписи, Отказ)
	
	// Очистка объекта от ссылок на объекты расчетов.
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ОчиститьОбъектыРасчетов(Объект, МассивСтруктур);
	КонецЕсли;
	
	МассивОбъектовРасшифровки = Новый Массив();
	ТаблицаСторон = ТаблицаСторон(Объект, МассивСтруктур);
	Ссылка = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, "Объект.Ссылка");
	
	Для Каждого СтруктураПараметров Из МассивСтруктур Цикл
		
		Если СтруктураПараметров.Свойство("СсылкаНового") Тогда
			Ссылка = СтруктураПараметров.СсылкаНового;
		КонецЕсли;
		
		//Создание элементов справочника
		ОбъектРасчетов = Неопределено;
		Если СсылкаЯвляетсяОбъектомРасчетов(Объект, СтруктураПараметров) Тогда
			ОбъектРасчетов = ПроверитьЗаполнитьОбъектРасчетовПоСтруктуре(Объект, СтруктураПараметров,,РежимЗаписи);
		КонецЕсли;
		
		//Заполнение расшифровки платежа
		Если ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа)
			И СтруктураПараметров.ИзменяетРасчеты Тогда
			
			СуммыДокумента        = ВзаиморасчетыСервер.СуммыДокумента(Объект, СтруктураПараметров);
			
			//Документ мультивалютный, расшифровку не проверяем.
			Если СуммыДокумента.СуммаДокументаБезЗалога = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			РасшифровкаПлатежа = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа); // ТабличнаяЧасть
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивОбъектовРасшифровки, РасшифровкаПлатежа.Выгрузить().ВыгрузитьКолонку("ОбъектРасчетов"));
			
			Валюта                = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ВалютаДокумента);
			Дата                  = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Дата);
			ЗаказОснование        = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ЗаказОснование);
			Договор               = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Договор);
			ПорядокРасчетов       = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПорядокРасчетов);
			Организация           = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация);
			ТипРасчетов           = СтруктураПараметров.ТипРасчетов;
			
			//В документах возврата Порядок расчетов не кэшируется и получается из договора.
			Если ПорядокРасчетов = Неопределено Тогда
				Договор = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Договор);
				Если ЗначениеЗаполнено(Договор) Тогда
					ПорядокРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ПорядокРасчетов")
				КонецЕсли;
			КонецЕсли;
			
			Если СтруктураПараметров.ЭтоПлатежИлиПрочийДокумент
				И Метаданные.ОпределяемыеТипы.ОбъектРасчетовАванс.Тип.СодержитТип(ТипЗнч(Ссылка))
				И РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
				// При отмене проведения удаляем объект расчетов платежку
				ТаблицаСторон.Очистить();
				
			ИначеЕсли СтруктураПараметров.ЭтоПлатежИлиПрочийДокумент
				И Метаданные.ОпределяемыеТипы.ОбъектРасчетовАванс.Тип.СодержитТип(ТипЗнч(Ссылка)) Тогда
				
				СтрокиСПустымОбъектом = РасшифровкаПлатежа.Выгрузить(Новый Структура("ОбъектРасчетов",Справочники.ОбъектыРасчетов.ПустаяСсылка()));
				МассивВалютВзаиморасчетов = СтрокиСПустымОбъектом.ВыгрузитьКолонку("ВалютаВзаиморасчетов");
				МассивВалютВзаиморасчетов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивВалютВзаиморасчетов);
				Если МассивВалютВзаиморасчетов.Количество() > 1 Тогда
					ТекстОшибки = НСтр("ru = 'Запрещено указывать разные валюты взаиморасчетов для неразнесенного платежа.'");
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,,Отказ);
				КонецЕсли;
				
				ВзаиморасчетыСервер.ЗаполнитьСуммуВзаиморасчетовВТабличнойЧасти(
					Валюта,
					Дата,
					РасшифровкаПлатежа,
					Организация);
				
				ЗаполнитьСтавкуНДС = РасшифровкаПлатежа.Количество() > 0 
					И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(РасшифровкаПлатежа[0], "СтавкаНДС");
				СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
				
				Если СтрокиСПустымОбъектом.Количество() > 0 И ЗначениеЗаполнено(ЗаказОснование) И ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказам Тогда
					ОбъектРасчетов = ПолучитьОбъектРасчетовПоСсылке(ЗаказОснование, Организация, ТипРасчетов);
					Если ЗаполнитьСтавкуНДС Тогда
						СтавкаНДС = ДенежныеСредстваСервер.СтавкаНДСОбъектаРасчетов(Организация, ОбъектРасчетов, ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом);
					КонецЕсли;
					
					КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
					ОбрабатываемыеСтроки = Новый Массив();
					
					Для Каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
						Если НЕ ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов) Тогда
							СтрокаРасшифровки.ОбъектРасчетов = ОбъектРасчетов;
							Если ЗаполнитьСтавкуНДС И ЗначениеЗаполнено(СтавкаНДС) Тогда
								СтрокаРасшифровки.СтавкаНДС = СтавкаНДС;
								ОбрабатываемыеСтроки.Добавить(СтрокаРасшифровки);
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					СтруктураПересчетаСуммы = Новый Структура("ЦенаВключаетНДС", Истина);
					СтруктураДействий = Новый Структура("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
					
					ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
						ОбрабатываемыеСтроки,
						СтруктураДействий,
						РасшифровкаПлатежа,
						КэшированныеЗначения);
					
				ИначеЕсли СтрокиСПустымОбъектом.Количество() > 0 И ЗначениеЗаполнено(Договор) И ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
					ОбъектРасчетов = ПолучитьОбъектРасчетовПоСсылке(Договор, Организация, ТипРасчетов);
					Если ЗаполнитьСтавкуНДС Тогда
						СтавкаНДС = ДенежныеСредстваСервер.СтавкаНДСОбъектаРасчетов(Организация, ОбъектРасчетов, ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом);
					КонецЕсли;
					
					КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
					ОбрабатываемыеСтроки = Новый Массив();
					
					Для Каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
						Если НЕ ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов) Тогда
							СтрокаРасшифровки.ОбъектРасчетов = ОбъектРасчетов;
							Если ЗаполнитьСтавкуНДС И ЗначениеЗаполнено(СтавкаНДС) Тогда
								СтрокаРасшифровки.СтавкаНДС = СтавкаНДС;
								ОбрабатываемыеСтроки.Добавить(СтрокаРасшифровки);
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					СтруктураПересчетаСуммы = Новый Структура("ЦенаВключаетНДС", Истина);
					СтруктураДействий = Новый Структура("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
					ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
						ОбрабатываемыеСтроки,
						СтруктураДействий,
						РасшифровкаПлатежа,
						КэшированныеЗначения);
						
				Иначе
					ОбъектыРасчетов = ПроверитьЗаполнитьОбъектРасчетовПоСтруктуре(Объект, СтруктураПараметров, Истина, РежимЗаписи);
					
					СтруктураПоиска = Новый Структура;
					СтруктураПоиска.Вставить("Организация");
					СтруктураПоиска.Вставить("Контрагент");СтруктураПоиска.Вставить("Партнер");
					
					КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
					ОбрабатываемыеСтроки = Новый Массив();
					
					Для Каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
						Если НЕ ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов)
							И ОбъектыРасчетов.Количество() > 0 Тогда
							
							Если ТипЗнч(Объект) = Тип("ФормаКлиентскогоПриложения") Тогда
								Идентификатор = СтрокаРасшифровки.ПолучитьИдентификатор();
							Иначе
								Идентификатор = СтрокаРасшифровки.НомерСтроки;
							КонецЕсли;
							
							Если СтруктураПараметров.ОрганизацияВСтроках Тогда
								СтруктураПоиска.Организация = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация, Идентификатор);
							Иначе
								СтруктураПоиска.Организация = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация);
							КонецЕсли;
							
							Если СтруктураПараметров.КонтрагентВСтроках Тогда
								СтруктураПоиска.Контрагент = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Контрагент, Идентификатор);
							Иначе
								СтруктураПоиска.Контрагент = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Контрагент);
							КонецЕсли;
							
							Если СтруктураПараметров.ПартнерВСтроках Тогда
								СтруктураПоиска.Партнер = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Партнер, Идентификатор);
							Иначе
								СтруктураПоиска.Партнер = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Партнер);
							КонецЕсли;
							
							#Вставка
							Если Не (ТипЗнч(Объект) = Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств") Или
								ТипЗнч(Объект) = Тип("ДокументОбъект.СписаниеБезналичныхДенежныхСредств")) Тогда
							#КонецВставки
							СтрокаРасшифровки.ОбъектРасчетов = ОбъектыРасчетов.НайтиСтроки(СтруктураПоиска)[0].ОбъектРасчетов;
							#Вставка
							КонецЕсли;
							#КонецВставки
							Если ЗаполнитьСтавкуНДС
								И Не ЗначениеЗаполнено(СтрокаРасшифровки.СтавкаНДС) Тогда
								СтавкаНДС = ДенежныеСредстваСервер.СтавкаНДСОбъектаРасчетов(Организация, СтрокаРасшифровки.ОбъектРасчетов, ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом);
								Если ЗначениеЗаполнено(СтавкаНДС) Тогда
									СтрокаРасшифровки.СтавкаНДС = СтавкаНДС;
									ОбрабатываемыеСтроки.Добавить(СтрокаРасшифровки);
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					СтруктураПересчетаСуммы = Новый Структура("ЦенаВключаетНДС", Истина);
					СтруктураДействий = Новый Структура("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
					ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
						ОбрабатываемыеСтроки,
						СтруктураДействий,
						РасшифровкаПлатежа,
						КэшированныеЗначения);
				КонецЕсли;
				
			ИначеЕсли СтруктураПараметров.ЭтоПродажаЗакупка И ЗначениеЗаполнено(ОбъектРасчетов) Тогда
				
				СуммаДокумента        = СуммыДокумента.СуммаЗалогаЗаТару + СуммыДокумента.СуммаДокументаБезЗалога;
				СуммаВзаиморасчетов   = СуммыДокумента.СуммаВзаиморасчетовБезЗалога + СуммыДокумента.СуммаВзаиморасчетовПоТаре;
				ВзаиморасчетыСервер.ЗаполнитьСуммыРасшифровкиНакладной(СуммаДокумента, СуммаВзаиморасчетов, РасшифровкаПлатежа, ОбъектРасчетов);
				
			КонецЕсли;
		КонецЕсли;
		
		Если СтруктураПараметров.Организация = Справочники.Организации.УправленческаяОрганизация Тогда
			МассивОбъектовРасшифровки.Добавить(ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ОбъектРасчетов));
		КонецЕсли;
		
	КонецЦикла;
	
	// Удаление лишних элементов справочника.
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ТаблицаСторон.Организация КАК Организация,
	|	ТаблицаСторон.Контрагент  КАК Контрагент,
	|	ТаблицаСторон.Партнер     КАК Партнер,
	|	ТаблицаСторон.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаСторон.ТипРасчетов КАК ТипРасчетов
	|ПОМЕСТИТЬ ТаблицаСторон
	|ИЗ &ТаблицаСторон КАК ТаблицаСторон
	|;
	|ВЫБРАТЬ
	|	ОбъектыРасчетов.Ссылка КАК Ссылка,
	|	ОбъектыРасчетов.ТолькоОстатки КАК ТолькоОстатки
	|ИЗ
	|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСторон КАК ТаблицаСторон
	|			ПО ТаблицаСторон.Организация = ОбъектыРасчетов.Организация
	|				И ТаблицаСторон.ТипРасчетов = ОбъектыРасчетов.ТипРасчетов
	|				И ТаблицаСторон.Контрагент = ОбъектыРасчетов.Контрагент
	|				И ТаблицаСторон.Партнер = ОбъектыРасчетов.Партнер
	|				И ТаблицаСторон.ВалютаВзаиморасчетов = ОбъектыРасчетов.ВалютаВзаиморасчетов
	|				И НЕ ОбъектыРасчетов.ТолькоОстатки
	|ГДЕ
	|	ОбъектыРасчетов.Объект = &Ссылка
	|	И ТаблицаСторон.ТипРасчетов ЕСТЬ NULL
	|	И ОбъектыРасчетов.Ссылка НЕ В (&МассивОбъектовРасшифровки)");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТаблицаСторон", ТаблицаСторон);
	Запрос.УстановитьПараметр("МассивОбъектовРасшифровки", МассивОбъектовРасшифровки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ОбъектыРасчетов");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
		Блокировка.Заблокировать();
		
		ПроверитьУдалитьОбъектРасчетов(Выборка.Ссылка, Отказ, НЕ Выборка.ТолькоОстатки);
	КонецЦикла;
	
	//Заполнение объектов расчетов в Объект
	Если НЕ Отказ И РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда
		ЗаполнитьОчиститьОбъектРасчетов(Объект, МассивСтруктур, РежимЗаписи);
	КонецЕсли;
	
КонецПроцедуры
